In [1]:
import os
import pandas as pd
import geopandas as gpd

import numpy as np

In [2]:
path = os.path.join('i2p_data','listing') # A default location to save raw data
fn=['2015-05-listings.csv','2016-06-listings.csv','2017-03-listings.csv','2018-05-listings.csv','2019-04-listings.csv']

In [3]:
cols=['id','host_id','host_since','first_review', 'last_review','latitude', 'longitude']
df15 = pd.read_csv(os.path.join(path,fn[0]), low_memory=False, usecols=cols)
df16 = pd.read_csv(os.path.join(path,fn[1]), low_memory=False, usecols=cols)
df17 = pd.read_csv(os.path.join(path,fn[2]), low_memory=False, usecols=cols)
df18 = pd.read_csv(os.path.join(path,fn[3]), low_memory=False, usecols=cols)
df19 = pd.read_csv(os.path.join(path,fn[4]), low_memory=False, usecols=cols)
print(f"Data frame is {df15.shape[0]:,} x {df15.shape[1]}") 
print(f"Data frame is {df16.shape[0]:,} x {df16.shape[1]}") 
print(f"Data frame is {df17.shape[0]:,} x {df17.shape[1]}") 
print(f"Data frame is {df18.shape[0]:,} x {df18.shape[1]}") 
print(f"Data frame is {df19.shape[0]:,} x {df19.shape[1]}")

Data frame is 18,436 x 7
Data frame is 42,646 x 7
Data frame is 53,904 x 7
Data frame is 69,886 x 7
Data frame is 79,671 x 7

In [4]:
frame=[df15,df16,df17,df18,df19]

In [5]:
for i in frame:
    i.drop(i[i.id.isna()].index.values, axis=0, inplace=True)
    print(f"Data frame is {i.shape[0]:,} x {i.shape[1]}")

Data frame is 18,436 x 7
Data frame is 42,646 x 7
Data frame is 53,904 x 7
Data frame is 69,886 x 7
Data frame is 79,671 x 7

In [6]:
df16.head()

,id,host_id,host_since,latitude,longitude,first_review,last_review
0,6781198,21869529,2014-09-28,51.398883,-0.278265,2015-07-24,2016-01-09
1,5290274,27396120,2015-02-08,51.421111,-0.280557,2015-04-06,2015-05-12
2,4023781,20860377,2014-09-02,51.414036,-0.286075,2014-10-05,2015-12-19
3,5098744,26345340,2015-01-19,51.413899,-0.306505,2015-02-28,2016-02-18
4,11093420,52632402,2015-12-29,51.408234,-0.291167,2016-02-09,2016-04-01

In [7]:
listing15 = gpd.GeoDataFrame(df15,geometry=gpd.points_from_xy(df15.longitude,df15.latitude,crs='epsg:4326')).to_crs('epsg:27700')
listing16 = gpd.GeoDataFrame(df16,geometry=gpd.points_from_xy(df16.longitude,df16.latitude,crs='epsg:4326')).to_crs('epsg:27700')
listing17 = gpd.GeoDataFrame(df17,geometry=gpd.points_from_xy(df17.longitude,df17.latitude,crs='epsg:4326')).to_crs('epsg:27700')
listing18 = gpd.GeoDataFrame(df18,geometry=gpd.points_from_xy(df18.longitude,df18.latitude,crs='epsg:4326')).to_crs('epsg:27700')
listing19 = gpd.GeoDataFrame(df19,geometry=gpd.points_from_xy(df19.longitude,df19.latitude,crs='epsg:4326')).to_crs('epsg:27700')
    #gdf=gpd.sjoin(boro, listing, how='inner').drop(columns=['latitude','longitude','index_right'])
    #gdf_1 = gdf.groupby('GSS_CODE')['id'].agg(Number_of_Listings_2015='count').reset_index()

In [8]:
boro = gpd.read_file(os.path.join('data','geo','Boroughs.gpkg'), driver='GPKG')

In [9]:
listings=[listing15,listing16,listing17,listing18,listing19]

In [10]:
gdf15=gpd.sjoin(boro, listing15, how='inner').drop(columns=['latitude','longitude','index_right'])
gdf16=gpd.sjoin(boro, listing16, how='inner').drop(columns=['latitude','longitude','index_right'])
gdf17=gpd.sjoin(boro, listing17, how='inner').drop(columns=['latitude','longitude','index_right'])
gdf18=gpd.sjoin(boro, listing18, how='inner').drop(columns=['latitude','longitude','index_right'])
gdf19=gpd.sjoin(boro, listing19, how='inner').drop(columns=['latitude','longitude','index_right'])

In [11]:
gdf15_1 = gdf15.groupby('GSS_CODE')['id'].agg(Number_of_Listings='count').reset_index() 
gdf16_1 = gdf16.groupby('GSS_CODE')['id'].agg(Number_of_Listings='count').reset_index() 
gdf17_1 = gdf17.groupby('GSS_CODE')['id'].agg(Number_of_Listings='count').reset_index() 
gdf18_1 = gdf18.groupby('GSS_CODE')['id'].agg(Number_of_Listings='count').reset_index() 
gdf19_1 = gdf19.groupby('GSS_CODE')['id'].agg(Number_of_Listings='count').reset_index()

In [12]:
df15_1 = pd.DataFrame(gdf15_1)
df16_1 = pd.DataFrame(gdf16_1)
df17_1 = pd.DataFrame(gdf17_1)
df18_1 = pd.DataFrame(gdf18_1)
df19_1 = pd.DataFrame(gdf19_1)

In [13]:
a='Year'
df15_1[a]=2015
df16_1[a]=2016
df17_1[a]=2017
df18_1[a]=2018
df19_1[a]=2019

In [14]:
frame1=[df15_1,df16_1,df17_1,df18_1,df19_1]
Airbnb_listing = pd.concat(frame1)

In [15]:
Airbnb_listing

     GSS_CODE  Number_of_Listings  Year
0   E09000001                 118  2015
1   E09000002                   7  2015
2   E09000003                  65  2015
3   E09000004                   5  2015
4   E09000005                 146  2015
..        ...                 ...   ...
28  E09000029                 252  2019
29  E09000030                7653  2019
30  E09000031                1292  2019
31  E09000032                4041  2019
32  E09000033                8863  2019

[163 rows x 3 columns]

### Education

In [16]:
path = os.path.join('i2p_data','demographic')
fn=['crime-rates.csv','education.csv','income-of-tax-payers.csv']

In [17]:
df_ed = pd.read_csv(os.path.join(path,fn[1]), low_memory=False)
print(f"Data frame is {df_ed.shape[0]:,} x {df_ed.shape[1]}")

Data frame is 5,558 x 8

In [18]:
df_ed.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5558 entries, 0 to 5557
Data columns (total 8 columns):
 #   Column                                            Non-Null Count  Dtype
---  ------                                            --------------  -----
 0   Code                                              5558 non-null   object
 1   Area                                              5558 non-null   object
 2   Year                                              5558 non-null   int64
 3   Qualifications of working age population (16-64)  5558 non-null   object
 4   number                                            5558 non-null   object
 5   denominator                                       5558 non-null   object
 6   percent                                           5558 non-null   object
 7   confidence                                        5558 non-null   object
dtypes: int64(1), object(7)
memory usage: 347.5+ KB

In [19]:
search ='E09'
E09=df_ed['Code'].str.startswith(search) 
df1_ed=df_ed[E09]

In [20]:
df2_ed = df1_ed[(df1_ed.Year>2014) & (df1_ed['Qualifications of working age population (16-64)']=='NVQ4+')]
df2_ed

,Code,Area,Year,Qualifications of working age population (16-64),number,denominator,percent,confidence
3815,E09000001,City of London,2015,NVQ4+,"4,500","5,700",80,*
3816,E09000002,Barking and Dagenham,2015,NVQ4+,"41,000","126,800",32.4,3.9
3817,E09000003,Barnet,2015,NVQ4+,"119,700","243,700",49.1,4.3
3818,E09000004,Bexley,2015,NVQ4+,"50,900","151,500",33.6,4.3
3819,E09000005,Brent,2015,NVQ4+,"99,300","220,400",45.1,3.6
...,...,...,...,...,...,...,...,...
5243,E09000029,Sutton,2019,NVQ4+,60500,131800,45.9,4.3
5244,E09000030,Tower Hamlets,2019,NVQ4+,142500,235600,60.5,4.8
5245,E09000031,Waltham Forest,2019,NVQ4+,94800,188900,50.2,5.2
5246,E09000032,Wandsworth,2019,NVQ4+,168300,235200,71.6,4.5
5247,E09000033,Westminster,2019,NVQ4+,112700,172200,65.5,5.1

In [21]:
df3_ed=df_ed.iloc[4872:4905]
df3_ed

,Code,Area,Year,Qualifications of working age population (16-64),number,denominator,percent,confidence
4872,E09000001,City of London,2018,NVQ4+,"7,500","7,500",100,-
4873,E09000002,Barking and Dagenham,2018,NVQ4+,"44,700","135,400",33,4.3
4874,E09000003,Barnet,2018,NVQ4+,"130,700","253,700",51.5,4.5
4875,E09000004,Bexley,2018,NVQ4+,"65,700","156,300",42,4.4
4876,E09000005,Brent,2018,NVQ4+,"88,600","219,700",40.3,4.3
4877,E09000006,Bromley,2018,NVQ4+,"102,100","205,900",49.6,4.6
4878,E09000007,Camden,2018,NVQ4+,"116,400","181,100",64.3,4.5
4879,E09000008,Croydon,2018,NVQ4+,"119,200","250,200",47.6,4.4
4880,E09000009,Ealing,2018,NVQ4+,"121,300","226,400",53.6,5.5
4881,E09000010,Enfield,2018,NVQ4+,"87,400","214,300",40.8,4.6
4882,E09000011,Greenwich,2018,NVQ4+,"100,100","194,400",51.5,4.6
4883,E09000012,Hackney,2018,NVQ4+,"108,200","202,600",53.4,4.4
4884,E09000013,Hammersmith and Fulham,2018,NVQ4+,"79,800","126,500",63.1,4.7
4885,E09000014,Haringey,2018,NVQ4+,"105,600","196,700",53.7,4.2
4886,E09000015,Harrow,2018,NVQ4+,"71,400","154,100",46.3,4.3
4887,E09000016,Havering,2018,NVQ4+,"48,000","159,800",30,4
4888,E09000017,Hillingdon,2018,NVQ4+,"86,000","199,100",43.2,4.4
4889,E09000018,Hounslow,2018,NVQ4+,"98,800","181,300",54.5,5.9
4890,E09000019,Islington,2018,NVQ4+,"117,700","175,500",67.1,4.6
4891,E09000020,Kensington and Chelsea,2018,NVQ4+,"64,300","103,800",62,4.8
4892,E09000021,Kingston upon Thames,2018,NVQ4+,"71,900","119,600",60.1,4.6
4893,E09000022,Lambeth,2018,NVQ4+,"150,200","243,600",61.7,4.6
4894,E09000023,Lewisham,2018,NVQ4+,"124,200","211,400",58.7,4.5
4895,E09000024,Merton,2018,NVQ4+,"73,200","137,700",53.2,4.9
4896,E09000025,Newham,2018,NVQ4+,119900,"245,600",48.8,4.9
4897,E09000026,Redbridge,2018,NVQ4+,"92,600","200,600",46.2,4
4898,E09000027,Richmond upon Thames,2018,NVQ4+,"83,600","123,200",67.9,4.6
4899,E09000028,Southwark,2018,NVQ4+,"149,200","230,900",64.6,4.2
4900,E09000029,Sutton,2018,NVQ4+,"62,100","128,300",48.4,4.6
4901,E09000030,Tower Hamlets,2018,NVQ4+,"125,700","229,700",54.7,5
4902,E09000031,Waltham Forest,2018,NVQ4+,"90,800","186,400",48.7,4.8
4903,E09000032,Wandsworth,2018,NVQ4+,"165,000","233,500",70.7,4.3
4904,E09000033,Westminster,2018,NVQ4+,"115,000","172,500",66.7,4.6

In [22]:
#df2_ed=df1_ed[df1_ed['Qualifications of working age population (16-64)']==df1_ed['Qualifications of working age population (16-64)'].iloc[1]]

In [23]:
frame0=[df2_ed,df3_ed]
Education=pd.concat(frame0)
Education

,Code,Area,Year,Qualifications of working age population (16-64),number,denominator,percent,confidence
3815,E09000001,City of London,2015,NVQ4+,"4,500","5,700",80,*
3816,E09000002,Barking and Dagenham,2015,NVQ4+,"41,000","126,800",32.4,3.9
3817,E09000003,Barnet,2015,NVQ4+,"119,700","243,700",49.1,4.3
3818,E09000004,Bexley,2015,NVQ4+,"50,900","151,500",33.6,4.3
3819,E09000005,Brent,2015,NVQ4+,"99,300","220,400",45.1,3.6
...,...,...,...,...,...,...,...,...
4900,E09000029,Sutton,2018,NVQ4+,"62,100","128,300",48.4,4.6
4901,E09000030,Tower Hamlets,2018,NVQ4+,"125,700","229,700",54.7,5
4902,E09000031,Waltham Forest,2018,NVQ4+,"90,800","186,400",48.7,4.8
4903,E09000032,Wandsworth,2018,NVQ4+,"165,000","233,500",70.7,4.3
4904,E09000033,Westminster,2018,NVQ4+,"115,000","172,500",66.7,4.6

In [24]:
Education = Education[['Code','Area','Year','percent']]
Education.rename({'percent':'percentage_of_qualifications_of_working_age_population (16-64)'},axis='columns',inplace=True)
Education

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\pandas\core\frame.py:4304: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

,Code,Area,Year,percentage_of_qualifications_of_working_age_population (16-64)
3815,E09000001,City of London,2015,80
3816,E09000002,Barking and Dagenham,2015,32.4
3817,E09000003,Barnet,2015,49.1
3818,E09000004,Bexley,2015,33.6
3819,E09000005,Brent,2015,45.1
...,...,...,...,...
4900,E09000029,Sutton,2018,48.4
4901,E09000030,Tower Hamlets,2018,54.7
4902,E09000031,Waltham Forest,2018,48.7
4903,E09000032,Wandsworth,2018,70.7
4904,E09000033,Westminster,2018,66.7

### income

In [25]:
df_in = pd.read_csv(os.path.join(path,fn[2]), low_memory=False,header=[1])  
print(f"Data frame is {df_in.shape[0]:,} x {df_in.shape[1]}")

Data frame is 51 x 56

In [26]:
print(df_in.columns.get_level_values(0))

Index(['Code', 'Area', 'Number of Individuals', 'Mean ?', 'Median ?',
       'Number of Individuals.1', 'Mean ?.1', 'Median ?.1',
       'Number of Individuals.2', 'Mean ?.2', 'Median ?.2',
       'Number of Individuals.3', 'Mean ?.3', 'Median ?.3',
       'Number of Individuals.4', 'Mean ?.4', 'Median ?.4',
       'Number of Individuals.5', 'Mean ?.5', 'Median ?.5',
       'Number of Individuals.6', 'Mean ?.6', 'Median ?.6',
       'Number of Individuals.7', 'Mean ?.7', 'Median ?.7',
       'Number of Individuals.8', 'Mean ?.8', 'Median ?.8',
       'Number of Individuals.9', 'Mean ?.9', 'Median ?.9',
       'Number of Individuals.10', 'Mean ?.10', 'Median ?.10',
       'Number of Individuals.11', 'Mean ?.11', 'Median ?.11',
       'Number of Individuals.12', 'Mean ?.12', 'Median ?.12',
       'Number of Individuals.13', 'Mean ?.13', 'Median ?.13',
       'Number of Individuals.14', 'Mean ?.14', 'Median ?.14',
       'Number of Individuals.15', 'Mean ?.15', 'Median ?.15',
       'Number of Individuals.16', 'Mean ?.16', 'Median ?.16',
       'Number of Individuals.17', 'Mean ?.17', 'Median ?.17'],
      dtype='object')

In [27]:
df_in[['Median ?']].head(3)

  Median ?
0      NaN
1   40,400
2   15,100

In [28]:
df_in.head()

,Code,Area,Number of Individuals,Mean ?,Median ?,Number of Individuals.1,Mean ?.1,Median ?.1,Number of Individuals.2,Mean ?.2,...,Median ?.14,Number of Individuals.15,Mean ?.15,Median ?.15,Number of Individuals.16,Mean ?.16,Median ?.16,Number of Individuals.17,Mean ?.17,Median ?.17
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,E09000001,City of London,"10,000","109,800","40,400","10,000","137,000","65,000","12,000","92,900",...,"61,100","10,000","142,000","60,000","12,000","157,000","57,300","11,000","148,000","60,000"
2,E09000002,Barking and Dagenham,"62,000","16,200","15,100","71,000","18,100","15,600","56,000","18,600",...,"21,800","83,000","25,900","22,100","88,000","26,700","23,300","85,000","27,400","23,900"
3,E09000003,Barnet,"161,000","26,800","18,700","156,000","30,800","19,400","159,000","30,400",...,"27,100","178,000","49,000","27,700","180,000","48,600","28,800","188,000","49,500","28,700"
4,E09000004,Bexley,"105,000","20,500","17,200","116,000","19,800","17,300","112,000","22,000",...,"24,400","127,000","30,900","24,500","125,000","32,300","26,100","122,000","33,500","26,900"

In [29]:
df1_in=df_in.iloc[:,-12:]

In [30]:
df1_in['GSS_CODE']=df_in.Code
df1_in['Borough']=df_in.Area

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [31]:
df1_in.head()

,Number of Individuals.14,Mean ?.14,Median ?.14,Number of Individuals.15,Mean ?.15,Median ?.15,Number of Individuals.16,Mean ?.16,Median ?.16,Number of Individuals.17,Mean ?.17,Median ?.17,GSS_CODE,Borough
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,"9,000","144,000","61,100","10,000","142,000","60,000","12,000","157,000","57,300","11,000","148,000","60,000",E09000001,City of London
2,"74,000","25,500","21,800","83,000","25,900","22,100","88,000","26,700","23,300","85,000","27,400","23,900",E09000002,Barking and Dagenham
3,"175,000","45,800","27,100","178,000","49,000","27,700","180,000","48,600","28,800","188,000","49,500","28,700",E09000003,Barnet
4,"122,000","30,200","24,400","127,000","30,900","24,500","125,000","32,300","26,100","122,000","33,500","26,900",E09000004,Bexley

In [32]:
df1_in.columns

Index(['Number of Individuals.14', 'Mean ?.14', 'Median ?.14',
       'Number of Individuals.15', 'Mean ?.15', 'Median ?.15',
       'Number of Individuals.16', 'Mean ?.16', 'Median ?.16',
       'Number of Individuals.17', 'Mean ?.17', 'Median ?.17', 'GSS_CODE',
       'Borough'],
      dtype='object')

In [33]:
df1_in.drop(['Number of Individuals.14', 'Mean ?.14',
       'Number of Individuals.15', 'Mean ?.15', 
       'Number of Individuals.16', 'Mean ?.16', 
       'Number of Individuals.17', 'Mean ?.17'],axis=1, inplace=True)

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\pandas\core\frame.py:4170: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [34]:
df1_in.head()

,Median ?.14,Median ?.15,Median ?.16,Median ?.17,GSS_CODE,Borough
0,NaN,NaN,NaN,NaN,NaN,NaN
1,"61,100","60,000","57,300","60,000",E09000001,City of London
2,"21,800","22,100","23,300","23,900",E09000002,Barking and Dagenham
3,"27,100","27,700","28,800","28,700",E09000003,Barnet
4,"24,400","24,500","26,100","26,900",E09000004,Bexley

In [35]:
df1_in.drop(df1_in[df1_in.Borough.isna()].index.values,axis=0, inplace=True)

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\pandas\core\frame.py:4170: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [36]:
df1_in.head()

,Median ?.14,Median ?.15,Median ?.16,Median ?.17,GSS_CODE,Borough
1,"61,100","60,000","57,300","60,000",E09000001,City of London
2,"21,800","22,100","23,300","23,900",E09000002,Barking and Dagenham
3,"27,100","27,700","28,800","28,700",E09000003,Barnet
4,"24,400","24,500","26,100","26,900",E09000004,Bexley
5,"22,700","23,200","24,100","24,700",E09000005,Brent

In [37]:
search ='E09'
E09=df1_in['GSS_CODE'].str.startswith(search) 
df1_in[E09]

,Median ?.14,Median ?.15,Median ?.16,Median ?.17,GSS_CODE,Borough
1,"61,100","60,000","57,300","60,000",E09000001,City of London
2,"21,800","22,100","23,300","23,900",E09000002,Barking and Dagenham
3,"27,100","27,700","28,800","28,700",E09000003,Barnet
4,"24,400","24,500","26,100","26,900",E09000004,Bexley
5,"22,700","23,200","24,100","24,700",E09000005,Brent
6,"28,100","29,800","30,400","32,000",E09000006,Bromley
7,"33,100","34,400","35,500","37,300",E09000007,Camden
8,"25,100","26,300","25,600","27,500",E09000008,Croydon
9,"24,600","24,900","26,100","26,700",E09000009,Ealing
10,"25,300","25,100","25,400","26,300",E09000010,Enfield
11,"24,600","25,600","26,000","27,600",E09000011,Greenwich
12,"26,000","27,800","28,000","29,400",E09000012,Hackney
13,"30,100","32,000","32,300","33,200",E09000013,Hammersmith and Fulham
14,"25,800","25,600","25,100","27,100",E09000014,Haringey
15,"26,100","26,300","27,300","27,600",E09000015,Harrow
16,"24,900","26,000","26,100","27,900",E09000016,Havering
17,"25,300","25,900","26,200","27,100",E09000017,Hillingdon
18,"24,700","25,000","26,100","26,400",E09000018,Hounslow
19,"31,000","31,100","32,900","33,400",E09000019,Islington
20,"38,700","37,500","39,500","40,400",E09000020,Kensington and Chelsea
21,"29,100","30,300","30,200","32,400",E09000021,Kingston-upon-Thames
22,"27,300","28,400","29,200","29,900",E09000022,Lambeth
23,"24,900","25,800","26,700","27,300",E09000023,Lewisham
24,"27,600","28,500","29,500","30,200",E09000024,Merton
25,"20,200","22,100","22,500","24,100",E09000025,Newham
26,"25,700","26,400","27,400","28,000",E09000026,Redbridge
27,"35,800","35,500","36,600","36,100",E09000027,Richmond-upon-Thames
28,"27,700","27,100","29,400","29,400",E09000028,Southwark
29,"25,900","27,400","27,300","28,200",E09000029,Sutton
30,"26,600","28,900","30,500","30,200",E09000030,Tower Hamlets
31,"22,700","23,900","24,500","25,500",E09000031,Waltham Forest
32,"32,900","34,200","35,000","34,500",E09000032,Wandsworth
33,"35,100","37,800","36,100","39,700",E09000033,Westminster

In [38]:
df15_in=df1_in[E09][['GSS_CODE','Borough']]
df15_in['Median_income']=df1_in['Median ?.14']
df15_in['Year']=2015
#df15_in

In [39]:
df16_in=df1_in[E09][['GSS_CODE','Borough']]
df16_in['Median_income']=df1_in['Median ?.15']
df16_in['Year']=2016
#df16_in

In [40]:
df17_in=df1_in[E09][['GSS_CODE','Borough']]
df17_in['Median_income']=df1_in['Median ?.16']
df17_in['Year']=2017
#df17_in

In [41]:
df18_in=df1_in[E09][['GSS_CODE','Borough']]
df18_in['Median_income']=df1_in['Median ?.17']
df18_in['Year']=2018
#df18_in

In [42]:
frame2=[df15_in,df16_in,df17_in,df18_in]
Income = pd.concat(frame2)
Income['Median_income']=Income['Median_income'].str.replace(',','').str.replace(' ','').apply(pd.to_numeric)
Income

     GSS_CODE               Borough  Median_income  Year
1   E09000001        City of London          61100  2015
2   E09000002  Barking and Dagenham          21800  2015
3   E09000003                Barnet          27100  2015
4   E09000004                Bexley          24400  2015
5   E09000005                 Brent          22700  2015
..        ...                   ...            ...   ...
29  E09000029                Sutton          28200  2018
30  E09000030         Tower Hamlets          30200  2018
31  E09000031        Waltham Forest          25500  2018
32  E09000032            Wandsworth          34500  2018
33  E09000033           Westminster          39700  2018

[132 rows x 4 columns]

### population

In [43]:
path = os.path.join('i2p_data','demographic')
fn='population15-19.csv'

In [44]:
df_pop = pd.read_csv(os.path.join(path,fn), low_memory=False,header=[6])
print(f"Data frame is {df_pop.shape[0]:,} x {df_pop.shape[1]}")

Data frame is 7,380 x 29

In [45]:
df_pop

,CODE,AREA,AGE GROUP,2014,2015,2016,2017,2018,2019,2020,...,2030,2031,2032,2033,2034,2035,2036,2037,2038,2039
0,E92000001,England,0-4,"3,431","3,426","3,412","3,387","3,388","3,408","3,433",...,"3,466","3,461","3,459","3,459","3,462","3,468","3,478","3,491","3,508","3,528"
1,E92000001,England,5-9,"3,272","3,353","3,417","3,480","3,499","3,505","3,494",...,"3,553","3,552","3,547","3,540","3,532","3,525","3,521","3,518","3,518","3,521"
2,E92000001,England,10-14,"2,973","2,995","3,058","3,149","3,251","3,329","3,405",...,"3,539","3,560","3,576","3,588","3,595","3,599","3,598","3,593","3,586","3,578"
3,E92000001,England,15-19,"3,231","3,209","3,164","3,101","3,067","3,055","3,073",...,"3,611","3,594","3,567","3,566","3,585","3,610","3,631","3,647","3,659","3,667"
4,E92000001,England,20-24,"3,606","3,615","3,584","3,559","3,532","3,493","3,455",...,"3,696","3,758","3,819","3,837","3,842","3,832","3,815","3,788","3,787","3,806"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7375,E07000191,West Somerset,75-79,2,2,2,2,2,2,2,...,3,3,3,3,3,3,3,3,3,3
7376,E07000191,West Somerset,80-84,2,2,2,2,2,2,2,...,3,3,2,2,2,2,2,2,2,2
7377,E07000191,West Somerset,85-89,1,1,1,1,1,1,1,...,2,2,2,2,2,2,2,2,2,2
7378,E07000191,West Somerset,90+,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,2,2,2
7379,E07000191,West Somerset,All ages,34,34,34,34,34,34,34,...,35,35,36,36,36,36,36,36,36,36

In [46]:
df1_pop=df_pop[['CODE','AREA','AGE GROUP','2015','2016','2017','2018','2019']]
df1_pop

           CODE           AREA AGE GROUP   2015   2016   2017   2018   2019
0     E92000001        England       0-4  3,426  3,412  3,387  3,388  3,408
1     E92000001        England       5-9  3,353  3,417  3,480  3,499  3,505
2     E92000001        England     10-14  2,995  3,058  3,149  3,251  3,329
3     E92000001        England     15-19  3,209  3,164  3,101  3,067  3,055
4     E92000001        England     20-24  3,615  3,584  3,559  3,532  3,493
...         ...            ...       ...    ...    ...    ...    ...    ...
7375  E07000191  West Somerset     75-79      2      2      2      2      2
7376  E07000191  West Somerset     80-84      2      2      2      2      2
7377  E07000191  West Somerset     85-89      1      1      1      1      1
7378  E07000191  West Somerset       90+      1      1      1      1      1
7379  E07000191  West Somerset  All ages     34     34     34     34     34

[7380 rows x 8 columns]

In [47]:
search ='E09'
E09=df1_pop['CODE'].str.startswith(search) 
df2_pop=df1_pop[E09]

In [48]:
df2_pop

           CODE            AREA AGE GROUP 2015 2016 2017 2018 2019
4380  E09000007          Camden       0-4   14   14   14   14   14
4381  E09000007          Camden       5-9   13   14   14   15   14
4382  E09000007          Camden     10-14   12   12   12   13   13
4383  E09000007          Camden     15-19   13   14   14   14   15
4384  E09000007          Camden     20-24   23   24   24   24   24
...         ...             ...       ...  ...  ...  ...  ...  ...
5035  E09000031  Waltham Forest     75-79    5    5    5    5    5
5036  E09000031  Waltham Forest     80-84    4    4    4    4    4
5037  E09000031  Waltham Forest     85-89    2    2    3    3    3
5038  E09000031  Waltham Forest       90+    1    2    2    2    2
5039  E09000031  Waltham Forest  All ages  272  276  279  282  285

[660 rows x 8 columns]

In [49]:
df3_pop=df2_pop[df2_pop['AGE GROUP']=='All ages']
df3_pop.sample(3)

           CODE         AREA AGE GROUP 2015 2016 2017 2018 2019
4599  E09000028    Southwark  All ages  309  315  319  324  328
4979  E09000026    Redbridge  All ages  299  304  309  314  318
4659  E09000033  Westminster  All ages  241  246  250  254  258

In [50]:
df15_pop=df3_pop[['CODE','AREA']]
df16_pop=df3_pop[['CODE','AREA']]
df17_pop=df3_pop[['CODE','AREA']]
df18_pop=df3_pop[['CODE','AREA']]
df19_pop=df3_pop[['CODE','AREA']]

In [51]:
df15_pop['population']=df3_pop['2015']+'000'
df16_pop['population']=df3_pop['2016']+'000'
df17_pop['population']=df3_pop['2017']+'000'
df18_pop['population']=df3_pop['2018']+'000'
df19_pop['population']=df3_pop['2019']+'000'

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [52]:
df15_pop['Year']=2015
df16_pop['Year']=2016
df17_pop['Year']=2017
df18_pop['Year']=2018
df19_pop['Year']=2019

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [53]:
frame5=[df15_pop,df16_pop,df17_pop,df18_pop,df19_pop]
Population = pd.concat(frame5)
Population['population']=Population.population.astype('float').astype('int')

In [54]:
Population.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 165 entries, 4399 to 5039
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CODE        165 non-null    object
 1   AREA        165 non-null    object
 2   population  165 non-null    int32
 3   Year        165 non-null    int64
dtypes: int32(1), int64(1), object(2)
memory usage: 5.8+ KB

In [55]:
Population

           CODE                    AREA  population  Year
4399  E09000007                  Camden      243000  2015
4419  E09000001          City of London        8000  2015
4439  E09000012                 Hackney      269000  2015
4459  E09000013  Hammersmith And Fulham      181000  2015
4479  E09000014                Haringey      272000  2015
...         ...                     ...         ...   ...
4959  E09000024                  Merton      216000  2019
4979  E09000026               Redbridge      318000  2019
4999  E09000027    Richmond upon Thames      208000  2019
5019  E09000029                  Sutton      211000  2019
5039  E09000031          Waltham Forest      285000  2019

[165 rows x 4 columns]

### crime rate

In [56]:
path = os.path.join('i2p_data','demographic')
fn=['crime-rates.csv','education.csv','income-of-tax-payers.csv']

In [57]:
df_cr = pd.read_csv(os.path.join(path,fn[0]), low_memory=False)
print(f"Data frame is {df_cr.shape[0]:,} x {df_cr.shape[1]}")

Data frame is 6,660 x 6

In [58]:
df_cr.head()

,GSS_CODE,Borough,Year,Offences,Rate,Number_of_offences
0,E09000002,Barking and Dagenham,1999-00,All recorded offences,120.5,"19,567"
1,E09000003,Barnet,1999-00,All recorded offences,98.0,"30,708"
2,E09000004,Bexley,1999-00,All recorded offences,95.1,"20,680"
3,E09000005,Brent,1999-00,All recorded offences,127.7,"33,253"
4,E09000006,Bromley,1999-00,All recorded offences,89.8,"26,474"

In [59]:
df_cr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6660 entries, 0 to 6659
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   GSS_CODE            6480 non-null   object
 1   Borough             6660 non-null   object
 2   Year                6660 non-null   object
 3   Offences            6660 non-null   object
 4   Rate                6411 non-null   float64
 5   Number_of_offences  6591 non-null   object
dtypes: float64(1), object(5)
memory usage: 312.3+ KB

In [60]:
df_cr.Year.values.astype('str')

array(['1999-00', '1999-00', '1999-00', ..., '2016-17', '2016-17',
       '2016-17'], dtype='<U9')

In [61]:
for i in range(0,6660):
    df_cr.Year[i]='20'+ df_cr.Year[i][-2:]

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [62]:
df_cr

,GSS_CODE,Borough,Year,Offences,Rate,Number_of_offences
0,E09000002,Barking and Dagenham,2000,All recorded offences,120.5,"19,567"
1,E09000003,Barnet,2000,All recorded offences,98.0,"30,708"
2,E09000004,Bexley,2000,All recorded offences,95.1,"20,680"
3,E09000005,Brent,2000,All recorded offences,127.7,"33,253"
4,E09000006,Bromley,2000,All recorded offences,89.8,"26,474"
...,...,...,...,...,...,...
6655,NaN,Heathrow,2017,Other Notifiable Offences,NaN,"1,081"
6656,E13000001,Inner London,2017,Other Notifiable Offences,1.7,"6,041"
6657,E13000002,Outer London,2017,Other Notifiable Offences,1.3,"6,637"
6658,E12000007,Met Police Area,2017,Other Notifiable Offences,1.6,"13,759"
6659,727,England and Wales,2017,Other Notifiable Offences,NaN,NaN

In [63]:
df1_cr=df_cr[(df_cr.Year=='2014') |(df_cr.Year=='2015')|(df_cr.Year=='2016')|(df_cr.Year=='2017')]

In [64]:
df2_cr=df1_cr[df1_cr.Offences=='All recorded offences'][['GSS_CODE','Borough','Year','Offences','Rate']]

In [65]:
df2_cr.drop(df2_cr[df2_cr.GSS_CODE.isna()].index.values,axis=0, inplace=True)

In [66]:
df2_cr['Year']=df2_cr.Year.astype('float').astype('int')

In [67]:
search ='E09'
E09=df2_cr['GSS_CODE'].str.startswith(search) 
df2_cr[E09]

      GSS_CODE               Borough  Year               Offences   Rate
518  E09000002  Barking and Dagenham  2014  All recorded offences   82.9
519  E09000003                Barnet  2014  All recorded offences   61.6
520  E09000004                Bexley  2014  All recorded offences   50.0
521  E09000005                 Brent  2014  All recorded offences   77.1
522  E09000006               Bromley  2014  All recorded offences   61.2
..         ...                   ...   ...                    ...    ...
656  E09000029                Sutton  2017  All recorded offences   45.0
657  E09000030         Tower Hamlets  2017  All recorded offences   85.3
658  E09000031        Waltham Forest  2017  All recorded offences   64.9
659  E09000032            Wandsworth  2017  All recorded offences   65.8
660  E09000033           Westminster  2017  All recorded offences  171.3

[128 rows x 5 columns]

In [68]:
df3_cr=df2_cr[E09]
df3_cr['Crime_Rate']=df2_cr[E09].Rate

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [69]:
Crime=df3_cr[['GSS_CODE','Borough','Year','Offences','Crime_Rate']]
Crime.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 128 entries, 518 to 660
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   GSS_CODE    128 non-null    object
 1   Borough     128 non-null    object
 2   Year        128 non-null    int32
 3   Offences    128 non-null    object
 4   Crime_Rate  128 non-null    float64
dtypes: float64(1), int32(1), object(3)
memory usage: 5.5+ KB

### rents

In [70]:
path = os.path.join('i2p_data','rents')
fn='weekly-rents-borough.csv'

In [71]:
df_rent = pd.read_csv(os.path.join(path,fn), low_memory=False)
print(f"Data frame is {df_rent.shape[0]:,} x {df_rent.shape[1]}")

Data frame is 208 x 4

In [72]:
df_rent

      New Code                  Area  weekly-rent    year
0    E09000001        City of London       115.56  2014.0
1    E09000002  Barking and Dagenham       120.92  2014.0
2    E09000003                Barnet       123.29  2014.0
3    E09000004                Bexley       106.35  2014.0
4    E09000005                 Brent       118.15  2014.0
..         ...                   ...          ...     ...
203        NaN                   NaN          NaN     NaN
204        NaN                   NaN          NaN     NaN
205        NaN                   NaN          NaN     NaN
206        NaN                   NaN          NaN     NaN
207        NaN                   NaN          NaN     NaN

[208 rows x 4 columns]

In [73]:
df_rent.drop(df_rent[df_rent['New Code'].isna()].index.values,axis=0,inplace=True)

In [74]:
df_rent

      New Code                  Area  weekly-rent    year
0    E09000001        City of London       115.56  2014.0
1    E09000002  Barking and Dagenham       120.92  2014.0
2    E09000003                Barnet       123.29  2014.0
3    E09000004                Bexley       106.35  2014.0
4    E09000005                 Brent       118.15  2014.0
..         ...                   ...          ...     ...
193  E09000029                Sutton       117.09  2019.0
194  E09000030         Tower Hamlets       124.19  2019.0
195  E09000031        Waltham Forest       116.49  2019.0
196  E09000032            Wandsworth       128.01  2019.0
197  E09000033           Westminster       140.33  2019.0

[198 rows x 4 columns]

In [75]:
df_rent.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 198 entries, 0 to 197
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   New Code     198 non-null    object
 1   Area         198 non-null    object
 2   weekly-rent  198 non-null    float64
 3   year         198 non-null    float64
dtypes: float64(2), object(2)
memory usage: 7.7+ KB

In [76]:
#df_rent.year.astype('int')
df_rent['year'] = df_rent['year'].astype('int')

In [77]:
search ='E09'
E09=df_rent['New Code'].str.startswith(search) 
df_rent=df_rent[E09]

In [78]:
Rent=df_rent[df_rent.year.values>2014]
df_rent_2014=df_rent[df_rent.year.values==2014]

In [79]:
df_rent_2014.rename({'weekly-rent':'2014_weekly_rent'},axis='columns',inplace=True)
df_rent_2014

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\pandas\core\frame.py:4304: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

     New Code                    Area  2014_weekly_rent  year
0   E09000001          City of London            115.56  2014
1   E09000002    Barking and Dagenham            120.92  2014
2   E09000003                  Barnet            123.29  2014
3   E09000004                  Bexley            106.35  2014
4   E09000005                   Brent            118.15  2014
5   E09000006                 Bromley            111.69  2014
6   E09000007                  Camden            127.14  2014
7   E09000008                 Croydon            118.44  2014
8   E09000009                  Ealing            120.94  2014
9   E09000010                 Enfield            120.11  2014
10  E09000011               Greenwich            111.15  2014
11  E09000012                 Hackney            115.58  2014
12  E09000013  Hammersmith and Fulham            121.13  2014
13  E09000014                Haringey            113.88  2014
14  E09000015                  Harrow            125.88  2014
15  E09000016                Havering            110.47  2014
16  E09000017              Hillingdon            119.76  2014
17  E09000018                Hounslow            118.07  2014
18  E09000019               Islington            118.80  2014
19  E09000020  Kensington and Chelsea            118.05  2014
20  E09000021    Kingston upon Thames            124.45  2014
21  E09000022                 Lambeth            111.51  2014
22  E09000023                Lewisham            103.94  2014
23  E09000024                  Merton            109.76  2014
24  E09000025                  Newham            128.89  2014
25  E09000026               Redbridge            124.95  2014
26  E09000027    Richmond upon Thames            114.08  2014
27  E09000028               Southwark            116.32  2014
28  E09000029                  Sutton            114.68  2014
29  E09000030           Tower Hamlets            115.73  2014
30  E09000031          Waltham Forest            117.86  2014
31  E09000032              Wandsworth            121.88  2014
32  E09000033             Westminster            122.03  2014

In [80]:
Rent

      New Code                  Area  weekly-rent  year
33   E09000001        City of London       124.46  2015
34   E09000002  Barking and Dagenham       127.03  2015
35   E09000003                Barnet       127.16  2015
36   E09000004                Bexley       111.21  2015
37   E09000005                 Brent       123.16  2015
..         ...                   ...          ...   ...
193  E09000029                Sutton       117.09  2019
194  E09000030         Tower Hamlets       124.19  2019
195  E09000031        Waltham Forest       116.49  2019
196  E09000032            Wandsworth       128.01  2019
197  E09000033           Westminster       140.33  2019

[165 rows x 4 columns]

### dwellings

In [81]:
path = os.path.join('i2p_data','dwellings')
fn='tenure-households-borough.csv'

In [82]:
cols=['Code','Name','Year','Tenure','Number_of_households','Percent_of_households_in_borough']
df_oo = pd.read_csv(os.path.join(path,fn), low_memory=False,usecols=cols)
print(f"Data frame is {df_oo.shape[0]:,} x {df_oo.shape[1]}")

Data frame is 3,120 x 6

In [83]:
df_oo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3120 entries, 0 to 3119
Data columns (total 6 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Code                              3120 non-null   object
 1   Name                              3120 non-null   object
 2   Year                              3120 non-null   int64
 3   Tenure                            3120 non-null   object
 4   Number_of_households              2556 non-null   object
 5   Percent_of_households_in_borough  3120 non-null   object
dtypes: int64(1), object(5)
memory usage: 146.4+ KB

In [84]:
df_oo.sample(3)

,Code,Name,Year,Tenure,Number_of_households,Percent_of_households_in_borough
816,E09000001,City of London,2014,Buying.with.mortgage,-,-
1325,E09000030,Tower Hamlets,2017,Rented.from.Local.Authority.or.Housing.Associa...,42800,36.5
2811,E09000028,Southwark,2012,Total,NaN,100

In [85]:
df_oo.drop(df_oo[df_oo.Code.isna()].index.values,axis=0,inplace=True)

In [86]:
search ='E09'
E09=df_oo['Code'].str.startswith(search) 
df1_oo=df_oo[E09]

In [87]:
Occupancy=df1_oo[(df1_oo.Tenure=='Own.Outright') & (df1_oo.Year>2014)]
df_occupancy_2014=df1_oo[(df1_oo.Tenure=='Own.Outright') & (df1_oo.Year==2014)]

In [88]:
#Occupancy['Number_of_households']=Occupancy['Number_of_households'].str.replace('-','').str.replace(' ','').apply(pd.to_numeric)
#Occupancy['Percent_of_households_in_borough']=Occupancy['Percent_of_households_in_borough'].str.replace('-','').str.replace(' ','').apply(pd.to_numeric)
df_occupancy_2014['Number_of_households']=df_occupancy_2014.Number_of_households.str.replace('-','').str.replace(' ','').apply(pd.to_numeric)
#Occupancy.info()

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [89]:
df_occupancy_2014

,Code,Name,Year,Tenure,Number_of_households,Percent_of_households_in_borough
192,E09000001,City of London,2014,Own.Outright,NaN,-
193,E09000002,Barking and Dagenham,2014,Own.Outright,11800.0,17.5
194,E09000003,Barnet,2014,Own.Outright,46200.0,32.4
195,E09000004,Bexley,2014,Own.Outright,36500.0,37.5
196,E09000005,Brent,2014,Own.Outright,20500.0,20
197,E09000006,Bromley,2014,Own.Outright,47100.0,34.9
198,E09000007,Camden,2014,Own.Outright,24600.0,22.6
199,E09000008,Croydon,2014,Own.Outright,35800.0,24.1
200,E09000009,Ealing,2014,Own.Outright,35800.0,30.2
201,E09000010,Enfield,2014,Own.Outright,35200.0,27.8
202,E09000011,Greenwich,2014,Own.Outright,16800.0,15.7
203,E09000012,Hackney,2014,Own.Outright,14500.0,12.9
204,E09000013,Hammersmith and Fulham,2014,Own.Outright,18400.0,24.4
205,E09000014,Haringey,2014,Own.Outright,20000.0,20.4
206,E09000015,Harrow,2014,Own.Outright,28900.0,32.4
207,E09000016,Havering,2014,Own.Outright,37800.0,37.4
208,E09000017,Hillingdon,2014,Own.Outright,27300.0,25.7
209,E09000018,Hounslow,2014,Own.Outright,24100.0,25.4
210,E09000019,Islington,2014,Own.Outright,16700.0,16.1
211,E09000020,Kensington and Chelsea,2014,Own.Outright,19200.0,27.9
212,E09000021,Kingston upon Thames,2014,Own.Outright,21500.0,33
213,E09000022,Lambeth,2014,Own.Outright,27200.0,20.1
214,E09000023,Lewisham,2014,Own.Outright,19700.0,16.3
215,E09000024,Merton,2014,Own.Outright,24500.0,29.4
216,E09000025,Newham,2014,Own.Outright,18200.0,15.9
217,E09000026,Redbridge,2014,Own.Outright,27800.0,28.1
218,E09000027,Richmond upon Thames,2014,Own.Outright,29000.0,36.1
219,E09000028,Southwark,2014,Own.Outright,16500.0,12.8
220,E09000029,Sutton,2014,Own.Outright,29000.0,36.3
221,E09000030,Tower Hamlets,2014,Own.Outright,12400.0,10.6
222,E09000031,Waltham Forest,2014,Own.Outright,18000.0,18.9
223,E09000032,Wandsworth,2014,Own.Outright,27100.0,21.5
224,E09000033,Westminster,2014,Own.Outright,18500.0,17.4

### housing stock

In [90]:
path = os.path.join('i2p_data','dwellings')
fn='Number-dwellings-borough.csv'

In [91]:
cols=['ONS code','Area name','2014','2015','2016','2017','2018','2019']

df_sto = pd.read_csv(os.path.join(path,fn), low_memory=False,usecols=cols)
print(f"Data frame is {df_sto.shape[0]:,} x {df_sto.shape[1]}")

Data frame is 38 x 8

In [92]:
df_sto.drop(df_sto[df_sto['ONS code'].isna()].index.values,axis=0,inplace=True)

In [93]:
df_sto['2014']=df_sto['2014'].str.replace(',','').str.replace(' ','').apply(pd.to_numeric)
df_sto_2014=df_sto[['ONS code','Area name','2014']]

In [94]:
df_sto_2014.rename({'2014':'housing_stock_2014'},axis='columns',inplace=True)

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\pandas\core\frame.py:4304: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [95]:
df_sto_2014.sample(3)

     ONS code   Area name  housing_stock_2014
31  E09000032  Wandsworth              137757
2   E09000003      Barnet              143948
3   E09000004      Bexley               96186

In [96]:
df_sto.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 33 entries, 0 to 32
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ONS code   33 non-null     object
 1   Area name  33 non-null     object
 2   2014       33 non-null     int64
 3   2015       33 non-null     object
 4   2016       33 non-null     object
 5   2017       33 non-null     object
 6   2018       33 non-null     object
 7   2019       33 non-null     object
dtypes: int64(1), object(7)
memory usage: 2.3+ KB

In [97]:
df1_sto=df_sto[['ONS code','Area name']]
df2_sto=df_sto[['ONS code','Area name']]
df3_sto=df_sto[['ONS code','Area name']]
df4_sto=df_sto[['ONS code','Area name']]
df5_sto=df_sto[['ONS code','Area name']]

In [98]:
df1_sto['housing_stock']=df_sto['2015']
df2_sto['housing_stock']=df_sto['2016']
df3_sto['housing_stock']=df_sto['2017']
df4_sto['housing_stock']=df_sto['2018']
df5_sto['housing_stock']=df_sto['2019']

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [99]:
df1_sto['Year']=2015
df2_sto['Year']=2016
df3_sto['Year']=2017
df4_sto['Year']=2018
df5_sto['Year']=2019

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [100]:
frame3=[df1_sto,df2_sto,df3_sto,df4_sto,df5_sto]
housing_stock = pd.concat(frame3)

In [101]:
housing_stock['housing_stock']=housing_stock['housing_stock'].str.replace(',','').str.replace(' ','').apply(pd.to_numeric)

In [102]:
housing_stock

     ONS code             Area name  housing_stock  Year
0   E09000001        City of London           6229  2015
1   E09000002  Barking and Dagenham          73182  2015
2   E09000003                Barnet         145272  2015
3   E09000004                Bexley          96996  2015
4   E09000005                 Brent         115598  2015
..        ...                   ...            ...   ...
28  E09000029                Sutton          83553  2019
29  E09000030         Tower Hamlets         121539  2019
30  E09000031        Waltham Forest         103642  2019
31  E09000032            Wandsworth         148075  2019
32  E09000033           Westminster         125312  2019

[165 rows x 4 columns]

### vacant dwellings

In [103]:
path = os.path.join('i2p_data','dwellings')
fn='vacant-dwellings-borough.csv'

In [104]:
cols=['ONS code','Area name','2015','2016','2017','2018','2019']
df_v = pd.read_csv(os.path.join(path,fn), low_memory=False,header=[1])
print(f"Data frame is {df_v.shape[0]:,} x {df_v.shape[1]}")

Data frame is 111 x 34

In [105]:
df_v

,Unnamed: 0,Unnamed: 1,2004,2005,2006,2007,2008,2009,2010,2011,...,2010.1,2011.1,2012.1,2013.1,2014.1,2015.1,2016.1,2017.1,2018.1,2019.1
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,00AA,City of London,165,123,93,122,98,72,131,88,...,23,45,33,47,48,44,48,158,244,273
2,00AB,Barking and Dagenham,"1,623","1,906","2,477","2,064","1,650","1,643","1,570","1,578",...,557,468,295,242,259,202,110,115,106,206
3,00AC,Barnet,"3,607","3,767","3,486","3,320","4,036","3,652","3,679","3,201",...,"1,525","1,390","1,095","1,136","1,129","1,249","1,100","1,048","1,065",1113
4,00AD,Bexley,"2,161","2,157","2,309","2,247","2,123","2,059","1,755","1,971",...,670,779,473,527,334,395,387,475,488,645
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
106,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
107,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
108,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
109,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
110,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [106]:
df_v.drop(df_v[df_v['Unnamed: 0'].isna()].index.values,axis=0,inplace=True)

In [107]:
df_v['Borough']=df_v['Unnamed: 1']

In [108]:
df1_v=df_v[['Borough','2015','2016','2017','2018','2019']]

In [109]:
df1_v

                   Borough     2015     2016     2017     2018     2019
1           City of London       86      124      252      321      311
2     Barking and Dagenham    1,154      752      822      998      921
3                   Barnet    2,638    2,199    2,302    2,367    2,944
4                   Bexley    1,180    1,249    1,469    1,623    1,668
5                    Brent    1,073      968    1,103    1,126    1,662
6                  Bromley    2,751    2,645    2,636    2,986    2,994
7                   Camden    2,617    2,848    3,018    3,769    3,878
8                  Croydon    3,130    2,810    3,511    3,670    3,710
9                   Ealing    3,209    3,587    4,187    4,198    2,595
10                 Enfield    1,907    2,298    2,349    2,970    3,158
11               Greenwich    1,796    1,523    1,750    1,698    1,867
12                 Hackney    2,268    2,146    1,962    1,980    2,043
13  Hammersmith and Fulham      831      837      822      696      659
14                Haringey    2,397    2,537    2,481    2,619    2,268
15                  Harrow      825    1,440    1,694    1,123    1,956
16                Havering    1,352    1,259    1,427    1,628    1,669
17              Hillingdon    1,399    1,799    2,053    2,237    2,061
18                Hounslow    1,095      843      730      757    1,984
19               Islington    2,981    1,414    1,561    1,909    1,995
20  Kensington and Chelsea    2,145    2,062    2,119    1,916    2,067
21    Kingston upon Thames    1,206    1,523    1,548    1,690    1,676
22                 Lambeth    1,980    1,446    1,724    1,910    1,849
23                Lewisham    2,131    2,182    2,464    2,458    2,338
24                  Merton    1,249    1,189    1,436    1,430    1,498
25                  Newham    2,025    1,338    1,709    1,893    3,273
26               Redbridge    1,293    1,241    1,359    1,735    1,875
27    Richmond upon Thames    1,136    1,349    1,338    1,368    1,388
28               Southwark    4,677    5,041    5,944    6,761    6,303
29                  Sutton    1,799    1,772    1,779    1,955    2,165
30           Tower Hamlets    1,844    2,278    1,669    1,832    3,308
31          Waltham Forest    1,143    1,280    1,467    1,782    1,791
32              Wandsworth    1,309    1,139      898      776      804
33             Westminster    1,255      978      783      874      988
35            Inner London       ..       ..       ..       ..       ..
36            Outer London       ..       ..       ..       ..       ..
38                  London   59,881   58,096   62,366   67,055   71,666
40                 England  600,179  589,766  605,891  634,453  648,114

In [110]:
df_j=df_sto[['ONS code','Area name']]

In [111]:
df2_v = pd.merge(df1_v, df_j, left_on='Borough', right_on='Area name')

In [112]:
df2_v

,Borough,2015,2016,2017,2018,2019,ONS code,Area name
0,City of London,86,124,252,321,311,E09000001,City of London
1,Barking and Dagenham,"1,154",752,822,998,921,E09000002,Barking and Dagenham
2,Barnet,"2,638","2,199","2,302","2,367","2,944",E09000003,Barnet
3,Bexley,"1,180","1,249","1,469","1,623","1,668",E09000004,Bexley
4,Brent,"1,073",968,"1,103","1,126","1,662",E09000005,Brent
5,Bromley,"2,751","2,645","2,636","2,986","2,994",E09000006,Bromley
6,Camden,"2,617","2,848","3,018","3,769","3,878",E09000007,Camden
7,Croydon,"3,130","2,810","3,511","3,670","3,710",E09000008,Croydon
8,Ealing,"3,209","3,587","4,187","4,198","2,595",E09000009,Ealing
9,Enfield,"1,907","2,298","2,349","2,970","3,158",E09000010,Enfield
10,Greenwich,"1,796","1,523","1,750","1,698","1,867",E09000011,Greenwich
11,Hackney,"2,268","2,146","1,962","1,980","2,043",E09000012,Hackney
12,Hammersmith and Fulham,831,837,822,696,659,E09000013,Hammersmith and Fulham
13,Haringey,"2,397","2,537","2,481","2,619","2,268",E09000014,Haringey
14,Harrow,825,"1,440","1,694","1,123","1,956",E09000015,Harrow
15,Havering,"1,352","1,259","1,427","1,628","1,669",E09000016,Havering
16,Hillingdon,"1,399","1,799","2,053","2,237","2,061",E09000017,Hillingdon
17,Hounslow,"1,095",843,730,757,"1,984",E09000018,Hounslow
18,Islington,"2,981","1,414","1,561","1,909","1,995",E09000019,Islington
19,Kensington and Chelsea,"2,145","2,062","2,119","1,916","2,067",E09000020,Kensington and Chelsea
20,Kingston upon Thames,"1,206","1,523","1,548","1,690","1,676",E09000021,Kingston upon Thames
21,Lambeth,"1,980","1,446","1,724","1,910","1,849",E09000022,Lambeth
22,Lewisham,"2,131","2,182","2,464","2,458","2,338",E09000023,Lewisham
23,Merton,"1,249","1,189","1,436","1,430","1,498",E09000024,Merton
24,Newham,"2,025","1,338","1,709","1,893","3,273",E09000025,Newham
25,Redbridge,"1,293","1,241","1,359","1,735","1,875",E09000026,Redbridge
26,Richmond upon Thames,"1,136","1,349","1,338","1,368","1,388",E09000027,Richmond upon Thames
27,Southwark,"4,677","5,041","5,944","6,761","6,303",E09000028,Southwark
28,Sutton,"1,799","1,772","1,779","1,955","2,165",E09000029,Sutton
29,Tower Hamlets,"1,844","2,278","1,669","1,832","3,308",E09000030,Tower Hamlets
30,Waltham Forest,"1,143","1,280","1,467","1,782","1,791",E09000031,Waltham Forest
31,Wandsworth,"1,309","1,139",898,776,804,E09000032,Wandsworth
32,Westminster,"1,255",978,783,874,988,E09000033,Westminster

In [113]:
df15_v=df2_v[['ONS code','Borough']]
df16_v=df2_v[['ONS code','Borough']]
df17_v=df2_v[['ONS code','Borough']]
df18_v=df2_v[['ONS code','Borough']]
df19_v=df2_v[['ONS code','Borough']]

In [114]:
df15_v['Year']=2015
df16_v['Year']=2016
df17_v['Year']=2017
df18_v['Year']=2018
df19_v['Year']=2019

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [115]:
df15_v['vacant_dwellings']=df2_v['2015']
df16_v['vacant_dwellings']=df2_v['2016']
df17_v['vacant_dwellings']=df2_v['2017']
df18_v['vacant_dwellings']=df2_v['2018']
df19_v['vacant_dwellings']=df2_v['2019']

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [116]:
df16_v

     ONS code                 Borough  Year vacant_dwellings
0   E09000001          City of London  2016              124
1   E09000002    Barking and Dagenham  2016              752
2   E09000003                  Barnet  2016            2,199
3   E09000004                  Bexley  2016            1,249
4   E09000005                   Brent  2016              968
5   E09000006                 Bromley  2016            2,645
6   E09000007                  Camden  2016            2,848
7   E09000008                 Croydon  2016            2,810
8   E09000009                  Ealing  2016            3,587
9   E09000010                 Enfield  2016            2,298
10  E09000011               Greenwich  2016            1,523
11  E09000012                 Hackney  2016            2,146
12  E09000013  Hammersmith and Fulham  2016              837
13  E09000014                Haringey  2016            2,537
14  E09000015                  Harrow  2016            1,440
15  E09000016                Havering  2016            1,259
16  E09000017              Hillingdon  2016            1,799
17  E09000018                Hounslow  2016              843
18  E09000019               Islington  2016            1,414
19  E09000020  Kensington and Chelsea  2016            2,062
20  E09000021    Kingston upon Thames  2016            1,523
21  E09000022                 Lambeth  2016            1,446
22  E09000023                Lewisham  2016            2,182
23  E09000024                  Merton  2016            1,189
24  E09000025                  Newham  2016            1,338
25  E09000026               Redbridge  2016            1,241
26  E09000027    Richmond upon Thames  2016            1,349
27  E09000028               Southwark  2016            5,041
28  E09000029                  Sutton  2016            1,772
29  E09000030           Tower Hamlets  2016            2,278
30  E09000031          Waltham Forest  2016            1,280
31  E09000032              Wandsworth  2016            1,139
32  E09000033             Westminster  2016              978

In [117]:
frame4=[df15_v,df16_v,df17_v,df18_v,df19_v]
vacant_dwellings = pd.concat(frame4)

vacant_dwellings['vacant_dwellings']=vacant_dwellings['vacant_dwellings'].str.replace(',','').str.replace(' ','').apply(pd.to_numeric)

vacant_dwellings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 165 entries, 0 to 32
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ONS code          165 non-null    object
 1   Borough           165 non-null    object
 2   Year              165 non-null    int64
 3   vacant_dwellings  165 non-null    int64
dtypes: int64(2), object(2)
memory usage: 6.4+ KB

### owner occupancy rate

In [118]:
#df_occupancy_2014
owner_occupancy_rate= pd.merge(df_sto_2014, df_occupancy_2014, left_on=['ONS code'],right_on=['Code'])

In [119]:
owner_occupancy_rate.head(3)

,ONS code,Area name,housing_stock_2014,Code,Name,Year,Tenure,Number_of_households,Percent_of_households_in_borough
0,E09000001,City of London,6003,E09000001,City of London,2014,Own.Outright,NaN,-
1,E09000002,Barking and Dagenham,72668,E09000002,Barking and Dagenham,2014,Own.Outright,11800.0,17.5
2,E09000003,Barnet,143948,E09000003,Barnet,2014,Own.Outright,46200.0,32.4

In [120]:
owner_occupancy_rate['owner_occupancy_rate']=owner_occupancy_rate['Number_of_households']/owner_occupancy_rate['housing_stock_2014']*100

In [121]:
owner_occupancy_rate=owner_occupancy_rate[['ONS code','Area name','owner_occupancy_rate']]
owner_occupancy_rate.head(3)

    ONS code             Area name  owner_occupancy_rate
0  E09000001        City of London                   NaN
1  E09000002  Barking and Dagenham             16.238234
2  E09000003                Barnet             32.094923

In [122]:
Airbnb_listing

     GSS_CODE  Number_of_Listings  Year
0   E09000001                 118  2015
1   E09000002                   7  2015
2   E09000003                  65  2015
3   E09000004                   5  2015
4   E09000005                 146  2015
..        ...                 ...   ...
28  E09000029                 252  2019
29  E09000030                7653  2019
30  E09000031                1292  2019
31  E09000032                4041  2019
32  E09000033                8863  2019

[163 rows x 3 columns]

In [123]:
df15_air_oo=pd.merge(Airbnb_listing[Airbnb_listing.Year==2015],owner_occupancy_rate,how='left',left_on='GSS_CODE',right_on='ONS code')
df16_air_oo=pd.merge(Airbnb_listing[Airbnb_listing.Year==2016],owner_occupancy_rate,how='left',left_on='GSS_CODE',right_on='ONS code')
df17_air_oo=pd.merge(Airbnb_listing[Airbnb_listing.Year==2017],owner_occupancy_rate,how='left',left_on='GSS_CODE',right_on='ONS code')
df18_air_oo=pd.merge(Airbnb_listing[Airbnb_listing.Year==2018],owner_occupancy_rate,how='left',left_on='GSS_CODE',right_on='ONS code')
df19_air_oo=pd.merge(Airbnb_listing[Airbnb_listing.Year==2019],owner_occupancy_rate,how='left',left_on='GSS_CODE',right_on='ONS code')

In [124]:
frame8=[df15_air_oo,df16_air_oo,df17_air_oo,df18_air_oo,df19_air_oo]
df_air_oo=pd.concat(frame8)

In [125]:
df_air_oo['Air_oo']=df_air_oo['Number_of_Listings']*df_air_oo['owner_occupancy_rate']
df_air_oo=df_air_oo[['GSS_CODE','Year','Area name','Air_oo']]

In [126]:
df_air_oo.head(3)

    GSS_CODE  Year             Area name       Air_oo
0  E09000001  2015        City of London          NaN
1  E09000002  2015  Barking and Dagenham   113.667639
2  E09000003  2015                Barnet  2086.170006

### concatenate

In [127]:
frame6=[Rent,Airbnb_listing,df_air_oo,vacant_dwellings,
        housing_stock,Occupancy,Income,Population,Education,Crime]

for i in frame6:
    i.rename({'ONS code': 'GSS_CODE','Code': 'GSS_CODE','CODE':'GSS_CODE','Area':'Borough','AREA':'Borough','Area name':'Borough','Name':'Borough','New Code':'GSS_CODE','year':'Year'}, axis='columns',inplace=True)

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\pandas\core\frame.py:4304: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [128]:
'''result1 = pd.merge(housing_stock, vacant_dwellings, on=['GSS_CODE', 'Year'])#165
result2 = pd.merge(Rent, Population, on=['GSS_CODE', 'Year'])#165
result3 = pd.merge(Education, Income,how="left", on=['GSS_CODE', 'Year'])#165 #132 
result4 = pd.merge(Airbnb_listing,Crime,how="left", on=['GSS_CODE', 'Year'])#163
result5 = pd.merge(result4,Occupancy,how="left", on=['GSS_CODE', 'Year'])#163'''

'result1 = pd.merge(housing_stock, vacant_dwellings, on=[\'GSS_CODE\', \'Year\'])#165\nresult2 = pd.merge(Rent, Population, on=[\'GSS_CODE\', \'Year\'])#165\nresult3 = pd.merge(Education, Income,how="left", on=[\'GSS_CODE\', \'Year\'])#165 #132 \nresult4 = pd.merge(Airbnb_listing,Crime,how="left", on=[\'GSS_CODE\', \'Year\'])#163\nresult5 = pd.merge(result4,Occupancy,how="left", on=[\'GSS_CODE\', \'Year\'])#163'

In [129]:
results = frame6[0]
for i in frame6[1:]:
    results = results.merge(i,how='left', on=['GSS_CODE', 'Year'])

In [130]:
results

,GSS_CODE,Borough_x,weekly-rent,Year,Number_of_Listings,Borough_y,Air_oo,Borough_x,vacant_dwellings,Borough_y,...,Percent_of_households_in_borough,Borough_y,Median_income,Borough_x,population,Borough_y,percentage_of_qualifications_of_working_age_population (16-64),Borough,Offences,Crime_Rate
0,E09000001,City of London,124.46,2015,118.0,City of London,NaN,City of London,86,City of London,...,-,City of London,61100.0,City of London,8000,City of London,80,NaN,NaN,NaN
1,E09000002,Barking and Dagenham,127.03,2015,7.0,Barking and Dagenham,113.667639,Barking and Dagenham,1154,Barking and Dagenham,...,17.5,Barking and Dagenham,21800.0,Barking And Dagenham,203000,Barking and Dagenham,32.4,Barking and Dagenham,All recorded offences,81.9
2,E09000003,Barnet,127.16,2015,65.0,Barnet,2086.170006,Barnet,2638,Barnet,...,32.4,Barnet,27100.0,Barnet,382000,Barnet,49.1,Barnet,All recorded offences,61.9
3,E09000004,Bexley,111.21,2015,5.0,Bexley,189.736552,Bexley,1180,Bexley,...,37.5,Bexley,24400.0,Bexley,243000,Bexley,33.6,Bexley,All recorded offences,51.2
4,E09000005,Brent,123.16,2015,146.0,Brent,2624.540727,Brent,1073,Brent,...,20,Brent,22700.0,Brent,326000,Brent,45.1,Brent,All recorded offences,78.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
160,E09000029,Sutton,117.09,2019,252.0,Sutton,9043.435218,Sutton,2165,Sutton,...,NaN,NaN,NaN,Sutton,211000,Sutton,45.9,NaN,NaN,NaN
161,E09000030,Tower Hamlets,124.19,2019,7653.0,Tower Hamlets,86368.327645,Tower Hamlets,3308,Tower Hamlets,...,NaN,NaN,NaN,Tower Hamlets,327000,Tower Hamlets,60.5,NaN,NaN,NaN
162,E09000031,Waltham Forest,116.49,2019,1292.0,Waltham Forest,23340.024087,Waltham Forest,1791,Waltham Forest,...,NaN,NaN,NaN,Waltham Forest,285000,Waltham Forest,50.2,NaN,NaN,NaN
163,E09000032,Wandsworth,128.01,2019,4041.0,Wandsworth,79495.851390,Wandsworth,804,Wandsworth,...,NaN,NaN,NaN,Wandsworth,331000,Wandsworth,71.6,NaN,NaN,NaN
164,E09000033,Westminster,140.33,2019,8863.0,Westminster,136221.306504,Westminster,988,Westminster,...,NaN,NaN,NaN,Westminster,258000,Westminster,65.5,NaN,NaN,NaN

In [131]:
results.columns.values

array(['GSS_CODE', 'Borough_x', 'weekly-rent', 'Year',
       'Number_of_Listings', 'Borough_y', 'Air_oo', 'Borough_x',
       'vacant_dwellings', 'Borough_y', 'housing_stock', 'Borough_x',
       'Tenure', 'Number_of_households',
       'Percent_of_households_in_borough', 'Borough_y', 'Median_income',
       'Borough_x', 'population', 'Borough_y',
       'percentage_of_qualifications_of_working_age_population (16-64)',
       'Borough', 'Offences', 'Crime_Rate'], dtype=object)

In [132]:
results.head(3)

,GSS_CODE,Borough_x,weekly-rent,Year,Number_of_Listings,Borough_y,Air_oo,Borough_x,vacant_dwellings,Borough_y,...,Percent_of_households_in_borough,Borough_y,Median_income,Borough_x,population,Borough_y,percentage_of_qualifications_of_working_age_population (16-64),Borough,Offences,Crime_Rate
0,E09000001,City of London,124.46,2015,118.0,City of London,NaN,City of London,86,City of London,...,-,City of London,61100.0,City of London,8000,City of London,80,NaN,NaN,NaN
1,E09000002,Barking and Dagenham,127.03,2015,7.0,Barking and Dagenham,113.667639,Barking and Dagenham,1154,Barking and Dagenham,...,17.5,Barking and Dagenham,21800.0,Barking And Dagenham,203000,Barking and Dagenham,32.4,Barking and Dagenham,All recorded offences,81.9
2,E09000003,Barnet,127.16,2015,65.0,Barnet,2086.170006,Barnet,2638,Barnet,...,32.4,Barnet,27100.0,Barnet,382000,Barnet,49.1,Barnet,All recorded offences,61.9

In [137]:
results['Borough']=results['Borough_x']

In [139]:
results.sample(5)

,GSS_CODE,Borough_x,weekly-rent,Year,Number_of_Listings,Borough_y,Air_oo,Borough_x,vacant_dwellings,Borough_y,...,Percent_of_households_in_borough,Borough_y,Median_income,Borough_x,population,Borough_y,percentage_of_qualifications_of_working_age_population (16-64),Borough,Offences,Crime_Rate
104,E09000006,Bromley,115.72,2018,521.0,Bromley,17983.554777,Bromley,2986,Bromley,...,30.8,Bromley,32000.0,Bromley,337000,Bromley,49.6,Bromley,NaN,NaN
106,E09000008,Croydon,123.39,2018,813.0,Croydon,19276.120589,Croydon,3670,Croydon,...,26.2,Croydon,27500.0,Croydon,395000,Croydon,47.6,Croydon,NaN,NaN
49,E09000017,Hillingdon,126.37,2016,157.0,Hillingdon,4008.810573,Hillingdon,1799,Hillingdon,...,25.7,Hillingdon,25900.0,Hillingdon,304000,Hillingdon,44.7,Hillingdon,All recorded offences,73.8
147,E09000016,Havering,116.33,2019,221.0,Havering,8385.749706,Havering,1669,Havering,...,NaN,NaN,NaN,Havering,261000,Havering,33.7,Havering,NaN,NaN
158,E09000027,Richmond upon Thames,120.13,2019,1141.0,Richmond upon Thames,39608.570745,Richmond upon Thames,1388,Richmond upon Thames,...,NaN,NaN,NaN,Richmond upon Thames,208000,Richmond upon Thames,65.4,Richmond upon Thames,NaN,NaN

In [140]:
dataset=results[['GSS_CODE','Year','Borough',
           'weekly-rent','Number_of_Listings','Air_oo',
           'population', 
           'percentage_of_qualifications_of_working_age_population (16-64)',
           'Median_income', 
           'Crime_Rate']]
dataset.rename({'Borough_x':'Borough'},axis='columns',inplace=True)
dataset

C:\Users\Administrator\anaconda3\envs\sds2020\lib\site-packages\pandas\core\frame.py:4304: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

,GSS_CODE,Year,Borough,weekly-rent,Number_of_Listings,Air_oo,population,percentage_of_qualifications_of_working_age_population (16-64),Median_income,Crime_Rate
0,E09000001,2015,City of London,124.46,118.0,NaN,8000,80,61100.0,NaN
1,E09000002,2015,Barking and Dagenham,127.03,7.0,113.667639,203000,32.4,21800.0,81.9
2,E09000003,2015,Barnet,127.16,65.0,2086.170006,382000,49.1,27100.0,61.9
3,E09000004,2015,Bexley,111.21,5.0,189.736552,243000,33.6,24400.0,51.2
4,E09000005,2015,Brent,123.16,146.0,2624.540727,326000,45.1,22700.0,78.3
...,...,...,...,...,...,...,...,...,...,...
160,E09000029,2019,Sutton,117.09,252.0,9043.435218,211000,45.9,NaN,NaN
161,E09000030,2019,Tower Hamlets,124.19,7653.0,86368.327645,327000,60.5,NaN,NaN
162,E09000031,2019,Waltham Forest,116.49,1292.0,23340.024087,285000,50.2,NaN,NaN
163,E09000032,2019,Wandsworth,128.01,4041.0,79495.851390,331000,71.6,NaN,NaN
164,E09000033,2019,Westminster,140.33,8863.0,136221.306504,258000,65.5,NaN,NaN

In [141]:
path = os.path.join('i2p_data')
fn='dataset.csv'
dataset.to_csv(os.path.join(path,fn), index=False)

### OLS model

In [142]:
path = os.path.join('i2p_data') 
fn='dataset.csv'
df1 = pd.read_csv(os.path.join(path,fn), low_memory=False)

In [143]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 165 entries, 0 to 164
Data columns (total 10 columns):
 #   Column                                                          Non-Null Count  Dtype
---  ------                                                          --------------  -----
 0   GSS_CODE                                                        165 non-null    object
 1   Year                                                            165 non-null    int64
 2   Borough                                                         165 non-null    object
 3   weekly-rent                                                     165 non-null    float64
 4   Number_of_Listings                                              163 non-null    float64
 5   Air_oo                                                          158 non-null    float64
 6   population                                                      165 non-null    int64
 7   percentage_of_qualifications_of_working_age_population (16-64)  165 non-null    float64
 8   Median_income                                                   132 non-null    float64
 9   Crime_Rate                                                      96 non-null     float64
dtypes: float64(6), int64(2), object(2)
memory usage: 13.0+ KB